; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v6 ?v9)
             (pred_11 ?v13 ?v11)
             (pred_8 ?v6 ?v11)
             (pred_7 ?v12 ?v6 )
	     (pred_1 ?v6)
             (pred_3 ?v1)
             (pred_5 ?v13)
             (pred_10 ?v11)
             (pred_2 ?v6)
             (pred_4 ?v13)
             (pred_6 ?v6)
             (pred_12 ))



(:action op_5
:parameters (?v3 ?v10 ?v2 ?v5)
:precondition (and (pred_3 ?v3) (pred_3 ?v10) (pred_5 ?v2) (pred_10 ?v5)
          (pred_9 ?v3 ?v10) (pred_11 ?v2 ?v5)
                   (pred_8 ?v10 ?v5) (pred_1 ?v3) 
                   (pred_2 ?v10) (pred_4 ?v2))
:effect (and  (pred_6 ?v10) (not (pred_2 ?v10))))


(:action op_4
:parameters (?v3 ?v7)
:precondition (and (pred_3 ?v3) (pred_3 ?v7)
               (pred_1 ?v3) (pred_9 ?v3 ?v7) (pred_6 ?v7))
:effect (and (pred_1 ?v7) (not (pred_1 ?v3))))

(:action op_2
:parameters (?v3 ?v2)
:precondition (and (pred_3 ?v3) (pred_5 ?v2) 
                  (pred_1 ?v3) (pred_7 ?v2 ?v3) (pred_12 ))
:effect (and (pred_4 ?v2)
   (not (pred_7 ?v2 ?v3)) (not (pred_12 ))))


(:action op_3
:parameters (?v3 ?v8 ?v4)
:precondition (and (pred_3 ?v3) (pred_5 ?v8) (pred_5 ?v4)
                  (pred_1 ?v3) (pred_4 ?v4) (pred_7 ?v8 ?v3))
:effect (and (pred_4 ?v8) (pred_7 ?v4 ?v3)
        (not (pred_4 ?v4)) (not (pred_7 ?v8 ?v3))))

(:action op_1
:parameters (?v3 ?v2)
:precondition (and (pred_3 ?v3) (pred_5 ?v2) 
                  (pred_1 ?v3) (pred_4 ?v2))
:effect (and (pred_12 ) (pred_7 ?v2 ?v3) (not (pred_4 ?v2)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_25 obj_16 obj_06 obj_28 obj_04 obj_18 obj_13 obj_08 obj_26 obj_22 obj_03 obj_30 obj_11 obj_10 obj_20 obj_07 obj_17 obj_31 obj_32 obj_24 obj_29 obj_05 obj_02 obj_09 obj_12
    obj_15 obj_19 obj_23
    obj_21 obj_27 obj_01 obj_14
    )

    (:init
       (pred_12)

       (pred_3 obj_25)
       (pred_3 obj_16)
       (pred_3 obj_06)
       (pred_3 obj_28)
       (pred_3 obj_04)
       (pred_3 obj_18)
       (pred_3 obj_13)
       (pred_3 obj_08)
       (pred_3 obj_26)
       (pred_3 obj_22)
       (pred_3 obj_03)
       (pred_3 obj_30)
       (pred_3 obj_11)
       (pred_3 obj_10)
       (pred_3 obj_20)
       (pred_3 obj_07)
       (pred_3 obj_17)
       (pred_3 obj_31)
       (pred_3 obj_32)
       (pred_3 obj_24)
       (pred_3 obj_29)
       (pred_3 obj_05)
       (pred_3 obj_02)
       (pred_3 obj_09)
       (pred_3 obj_12)
       (pred_10 obj_15)
       (pred_10 obj_19)
       (pred_10 obj_23)
       (pred_5 obj_21)
       (pred_5 obj_27)
       (pred_5 obj_01)
       (pred_5 obj_14)

       (pred_9 obj_25 obj_18)
       (pred_9 obj_25 obj_16)
       (pred_9 obj_16 obj_13)
       (pred_9 obj_16 obj_06)
       (pred_9 obj_16 obj_25)
       (pred_9 obj_06 obj_08)
       (pred_9 obj_06 obj_28)
       (pred_9 obj_06 obj_16)
       (pred_9 obj_28 obj_26)
       (pred_9 obj_28 obj_04)
       (pred_9 obj_28 obj_06)
       (pred_9 obj_04 obj_22)
       (pred_9 obj_04 obj_28)
       (pred_9 obj_18 obj_03)
       (pred_9 obj_18 obj_13)
       (pred_9 obj_18 obj_25)
       (pred_9 obj_13 obj_30)
       (pred_9 obj_13 obj_08)
       (pred_9 obj_13 obj_16)
       (pred_9 obj_13 obj_18)
       (pred_9 obj_08 obj_11)
       (pred_9 obj_08 obj_26)
       (pred_9 obj_08 obj_06)
       (pred_9 obj_08 obj_13)
       (pred_9 obj_26 obj_10)
       (pred_9 obj_26 obj_22)
       (pred_9 obj_26 obj_28)
       (pred_9 obj_26 obj_08)
       (pred_9 obj_22 obj_20)
       (pred_9 obj_22 obj_04)
       (pred_9 obj_22 obj_26)
       (pred_9 obj_03 obj_07)
       (pred_9 obj_03 obj_30)
       (pred_9 obj_03 obj_18)
       (pred_9 obj_30 obj_17)
       (pred_9 obj_30 obj_11)
       (pred_9 obj_30 obj_13)
       (pred_9 obj_30 obj_03)
       (pred_9 obj_11 obj_31)
       (pred_9 obj_11 obj_10)
       (pred_9 obj_11 obj_08)
       (pred_9 obj_11 obj_30)
       (pred_9 obj_10 obj_32)
       (pred_9 obj_10 obj_20)
       (pred_9 obj_10 obj_26)
       (pred_9 obj_10 obj_11)
       (pred_9 obj_20 obj_24)
       (pred_9 obj_20 obj_22)
       (pred_9 obj_20 obj_10)
       (pred_9 obj_07 obj_29)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_07 obj_03)
       (pred_9 obj_17 obj_05)
       (pred_9 obj_17 obj_31)
       (pred_9 obj_17 obj_30)
       (pred_9 obj_17 obj_07)
       (pred_9 obj_31 obj_02)
       (pred_9 obj_31 obj_32)
       (pred_9 obj_31 obj_11)
       (pred_9 obj_31 obj_17)
       (pred_9 obj_32 obj_09)
       (pred_9 obj_32 obj_24)
       (pred_9 obj_32 obj_10)
       (pred_9 obj_32 obj_31)
       (pred_9 obj_24 obj_12)
       (pred_9 obj_24 obj_20)
       (pred_9 obj_24 obj_32)
       (pred_9 obj_29 obj_05)
       (pred_9 obj_29 obj_07)
       (pred_9 obj_05 obj_02)
       (pred_9 obj_05 obj_17)
       (pred_9 obj_05 obj_29)
       (pred_9 obj_02 obj_09)
       (pred_9 obj_02 obj_31)
       (pred_9 obj_02 obj_05)
       (pred_9 obj_09 obj_12)
       (pred_9 obj_09 obj_32)
       (pred_9 obj_09 obj_02)
       (pred_9 obj_12 obj_24)
       (pred_9 obj_12 obj_09)
       (pred_2 obj_25)
       (pred_2 obj_20)
       (pred_2 obj_11)
       (pred_2 obj_16)
       (pred_8  obj_25 obj_15)
       (pred_8  obj_20 obj_19)
       (pred_8  obj_11 obj_23)
       (pred_8  obj_16 obj_15)
       (pred_6 obj_06)
       (pred_6 obj_28)
       (pred_6 obj_04)
       (pred_6 obj_18)
       (pred_6 obj_13)
       (pred_6 obj_08)
       (pred_6 obj_26)
       (pred_6 obj_22)
       (pred_6 obj_03)
       (pred_6 obj_30)
       (pred_6 obj_10)
       (pred_6 obj_07)
       (pred_6 obj_17)
       (pred_6 obj_31)
       (pred_6 obj_32)
       (pred_6 obj_24)
       (pred_6 obj_29)
       (pred_6 obj_05)
       (pred_6 obj_02)
       (pred_6 obj_09)
       (pred_6 obj_12)

       (pred_11  obj_21 obj_15)
       (pred_11  obj_27 obj_19)
       (pred_11  obj_01 obj_23)
       (pred_11  obj_14 obj_23)
       (pred_7 obj_21 obj_04)
       (pred_7 obj_27 obj_32)
       (pred_7 obj_01 obj_08)
       (pred_7 obj_14 obj_18)
       (pred_1 obj_02)
    )

    (:goal (and
       (pred_7 obj_27 obj_07)
       (pred_7 obj_01 obj_10)
    ))
(:constraints
  (always (not (pred_1 obj_31)))
)
)

; plan
1. (op_4 obj_02 obj_09)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_09)
   goals met: 0 of 2
2. (op_4 obj_09 obj_32)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_32)
   goals met: 0 of 2
3. (op_2 obj_32 obj_27)
   deleted: (pred_7 obj_27 obj_32) (pred_12)
   added: (pred_4 obj_27)
   goals met: 0 of 2
4. (op_4 obj_32 obj_10)
   deleted: (pred_1 obj_32)
   added: (pred_1 obj_10)
   goals met: 0 of 2
5. (op_4 obj_10 obj_26)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_26)
   goals met: 0 of 2
6. (op_4 obj_26 obj_08)
   deleted: (pred_1 obj_26)
   added: (pred_1 obj_08)
   goals met: 0 of 2
7. (op_3 obj_08 obj_01 obj_27)
   deleted: (pred_4 obj_27) (pred_7 obj_01 obj_08)
   added: (pred_4 obj_01) (pred_7 obj_27 obj_08)
   goals met: 0 of 2
8. (op_4 obj_08 obj_26)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_26)
   goals met: 0 of 2
9. (op_4 obj_26 obj_10)
   deleted: (pred_1 obj_26)
   added: (pred_1 obj_10)
   goals met: 0 of 2
10. (op_1 obj_10 obj_01)
   deleted: (pred_4 obj_01)
   added: (pred_12) (pred_7 obj_01 obj_10)
   goals met: 1 of 2
11. (op_4 obj_10 obj_26)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_26)
   goals met: 1 of 2
12. (op_4 obj_26 obj_08)
   deleted: (pred_1 obj_26)
   added: (pred_1 obj_08)
   goals met: 1 of 2
13. (op_2 obj_08 obj_27)
   deleted: (pred_7 obj_27 obj_08) (pred_12)
   added: (pred_4 obj_27)
   goals met: 1 of 2
14. (op_4 obj_08 obj_13)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_13)
   goals met: 1 of 2
15. (op_4 obj_13 obj_18)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_18)
   goals met: 1 of 2
16. (op_4 obj_18 obj_03)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_03)
   goals met: 1 of 2
17. (op_4 obj_03 obj_07)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_07)
   goals met: 1 of 2
18. (op_1 obj_07 obj_27)
   deleted: (pred_4 obj_27)
   added: (pred_12) (pred_7 obj_27 obj_07)
   goals met: 2 of 2
